{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"mask_value": -1, "batch_input_shape": [null, 3, 84], "name": "masking_1", "trainable": true, "dtype": "float32"}}, {"class_name": "LSTM", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "stateful": false, "return_state": false, "dtype": "float32", "batch_input_shape": [null, 3, 84], "trainable": true, "units": 32, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "activation": "tanh", "kernel_constraint": null, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"seed": null, "gain": 1.0}}, "activity_regularizer": null, "implementation": 1, "recurrent_activation": "hard_sigmoid", "recurrent_regularizer": null, "return_sequences": false, "bias_constraint": null, "dropout": 0.0, "name": "lstm_1", "unroll": false, "unit_forget_bias": true, "recurrent_dropout": 0.0, "kernel_regularizer": null, "recurrent_constraint": null, "go_backwards": false, "bias_regularizer": null}}, {"class_name": "Dense", "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_1", "dtype": "float32", "bias_constraint": null, "batch_input_shape": [null, 32], "trainable": true, "bias_regularizer": null, "units": 33, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "activation": "linear", "kernel_regularizer": null, "kernel_constraint": null, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"activation": "softmax", "name": "activation_1", "trainable": true}}], "backend": "tensorflow", "keras_version": "2.1.4"}